### 画面遷移図
Figma：https://www.figma.com/design/MM8xCLBfN54FSgZgbeImFW/Untitled?node-id=0-1&p=f&t=rfrPI6PKFKOcN1xi-0

### READMEに記載した機能
- [x] ユーザー登録機能
- [x] ログイン機能
- [x] メールアドレス変更機能
- [x] 記事投稿機能（画像投稿含む）
- [x] 記事閲覧機能（未ログインでも閲覧可能）
- [x] 記事編集機能
- [x] 記事削除機能
- [x] コメント投稿機能
- [x] コメント閲覧機能（未ログインでも閲覧可能）
- [x] タグ投稿機能
- [x] タグ編集機能
- [x] タグ削除機能
- [x] いいね機能
- [x] いいね解除機能

### 未ログインでも閲覧または利用できるページ
- [x] 記事閲覧機能
- [x] 記事検索機能
- [x] コメント閲覧機能

### メールアドレス・パスワード変更確認項目
- [x] パスワード

### 各画面の作り込み
画面遷移だけでなく、必要なボタンやフォームが確認できるくらい作り込めているか？
- [x] 作り込みはある程度完了している（Figmaを見て画面の作成ができる状態にある）
